### Step 1 : Data Exploration and Loading (EDA)

In [4]:
# importing libraries
import pandas as pd

In [5]:
# Reads in dataset that is passed as parameter
df = pd.read_csv("walmart-sales-data.csv", encoding_errors="ignore")

# Shows the shape of the data in "no. of rows x no. of columns" format)
df.shape

(10051, 11)

In [10]:
# Shows first 5 rows if no parameter is passed
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,$74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,$15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,$46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,$58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,$86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

In [11]:
# Gives statistical info about data
df.describe()

         invoice_id      quantity        rating  profit_margin
count  10051.000000  10020.000000  10051.000000   10051.000000
mean    5025.741220      2.353493      5.825659       0.393791
std     2901.174372      1.602658      1.763991       0.090669
min        1.000000      1.000000      3.000000       0.180000
25%     2513.500000      1.000000      4.000000       0.330000
50%     5026.000000      2.000000      6.000000       0.330000
75%     7538.500000      3.000000      7.000000       0.480000
max    10000.000000     10.000000     10.000000       0.570000

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10051 entries, 0 to 10050
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10051 non-null  int64
 1   Branch          10051 non-null  object
 2   City            10051 non-null  object
 3   category        10051 non-null  object
 4   unit_price      10020 non-null  object
 5   quantity        10020 non-null  float64
 6   date            10051 non-null  object
 7   time            10051 non-null  object
 8   payment_method  10051 non-null  object
 9   rating          10051 non-null  float64
 10  profit_margin   10051 non-null  float64
dtypes: float64(3), int64(1), object(7)
memory usage: 863.9+ KB

In [13]:
# Count total No. of duplicates
df.duplicated().sum()

51

In [14]:
# Removes the total no. of duplicates
df.drop_duplicates(inplace=True)

In [15]:
df.duplicated().sum()

0

In [16]:
# Count the no. of null values
df.isnull().sum()

invoice_id         0
Branch             0
City               0
category           0
unit_price        31
quantity          31
date               0
time               0
payment_method     0
rating             0
profit_margin      0
dtype: int64

In [17]:
# Dropping the null values present in the dataset
df.dropna(inplace=True)

In [18]:
df.isnull().sum()

invoice_id        0
Branch            0
City              0
category          0
unit_price        0
quantity          0
date              0
time              0
payment_method    0
rating            0
profit_margin     0
dtype: int64

In [19]:
df.shape

(9969, 11)

In [20]:
# Shows the data type of each column
df.dtypes

invoice_id          int64
Branch             object
City               object
category           object
unit_price         object
quantity          float64
date               object
time               object
payment_method     object
rating            float64
profit_margin     float64
dtype: object

In [21]:
# Replaces '$' with blank and changes data type of 'unit_price' column to float
df["unit_price"] = df["unit_price"].str.replace("$"," ").astype(float)

In [22]:
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9969 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      9969 non-null   int64
 1   Branch          9969 non-null   object
 2   City            9969 non-null   object
 3   category        9969 non-null   object
 4   unit_price      9969 non-null   float64
 5   quantity        9969 non-null   float64
 6   date            9969 non-null   object
 7   time            9969 non-null   object
 8   payment_method  9969 non-null   object
 9   rating          9969 non-null   float64
 10  profit_margin   9969 non-null   float64
dtypes: float64(4), int64(1), object(6)
memory usage: 934.6+ KB

In [24]:
df.columns

Index(['invoice_id', 'Branch', 'City', 'category', 'unit_price', 'quantity',
       'date', 'time', 'payment_method', 'rating', 'profit_margin'],
      dtype='object')

In [25]:
# Creating new column 'total'
df["total"] = df["quantity"] * df["unit_price"]

In [26]:
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin,total
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48,522.83
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48,76.40
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33,324.31
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33,465.76
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48,604.17

In [27]:
df.shape

(9969, 12)

In [ ]:
# renaming the cleaned dataset file
df.to_csv("walmart-cleaned-dataset.csv", index=False)

### Establishing connection with MS SQL Server

In [29]:
#for connecting to sql server
import pypyodbc as pyodbc

#for handling database operations
from sqlalchemy import create_engine

In [34]:
# integrating sql server engine with server name and database
engine_sqlserver = create_engine("mssql+pyodbc://@HP-I5-8GB-ARIJI/Walmart?driver=ODBC+Driver+17+for+SQL+Server&Trusted_Connection=yes")

try:
    engine_sqlserver
    print("Connection Successed to sql server")
except:
    print("Unable to connect")

Connection Successed to sql server

In [33]:
# exporting data to sql server
df.to_sql(name='Walmart', con=engine_sqlserver, if_exists='append', index=False)

51

In [ ]:
# testing the connection to fetch records from database using sql queries in python
query = "SELECT TOP 10 * FROM Walmart"
df = pd.read_sql(query, engine_sqlserver)
print(df)

   invoice_id   Branch         City                category  unit_price  \
0           1  WALM003  San Antonio       Health and beauty       74.69
1           2  WALM048    Harlingen  Electronic accessories       15.28
2           3  WALM067  Haltom City      Home and lifestyle       46.33
3           4  WALM064      Bedford       Health and beauty       58.22
4           5  WALM013       Irving       Sports and travel       86.31
5           6  WALM026       Denton  Electronic accessories       85.39
6           7  WALM088     Cleburne  Electronic accessories       68.84
7           8  WALM100       Canyon      Home and lifestyle       73.56
8           9  WALM066    Grapevine       Health and beauty       36.26
9          10  WALM065   Texas City      Food and beverages       54.84

   quantity      date      time payment_method  rating  profit_margin   total
0       7.0  05/01/19  13:08:00        Ewallet     9.1           0.48  522.83
1       5.0  08/03/19  10:29:00           Cash     9.6           0.48   76.40
2       7.0  03/03/19  13:23:00    Credit card     7.4           0.33  324.31
3       8.0  27/01/19  20:33:00        Ewallet     8.4           0.33  465.76
4       7.0  08/02/19  10:37:00        Ewallet     5.3           0.48  604.17
5       7.0  25/03/19  18:30:00        Ewallet     4.1           0.48  597.73
6       6.0  25/02/19  14:36:00        Ewallet     5.8           0.33  413.04
7      10.0  24/02/19  11:38:00        Ewallet     8.0           0.18  735.60
8       2.0  10/01/19  17:15:00    Credit card     7.2           0.33   72.52
9       3.0  20/02/19  13:27:00    Credit card     5.9           0.33  164.52